Конфигурация/src/Documents/ОплатаЗаказа/ОплатаЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОплатаЗаказа</name>
  <registerRecords>AccumulationRegister.ДоставкиИОплаты</registerRecords>
  <attributes>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </attributes>
  <attributes>
    <name>Курьер</name>
    <type>
      <types>CatalogRef.Курьеры</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

Конфигурация/src/AccumulationRegisters/ДоставкиИОплаты/ДоставкиИОплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДоставкиИОплаты</name>
  <resources>
    <name>КоличествоНеоплаченныхЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеоплаченнаяСуммаЗаказов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОснованиеПлатежа</name>
    <type>
      <types>DocumentRef.Заказ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Курьеры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Конфигурация/src/Documents/ОплатаЗаказа/ObjectModule.bsl
// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)

	// регистр ДоставкиИОплаты
	Движения.ДоставкиИОплаты.Записывать = Истина;
	ДвижениеНеоплаченныеЗаказы = Движения.ДоставкиИОплаты.Добавить();
	ДвижениеНеоплаченныеЗаказы.Период = Дата;
	ДвижениеНеоплаченныеЗаказы.ВидДвижения = ВидДвиженияНакопления.Расход;
	ДвижениеНеоплаченныеЗаказы.ОснованиеПлатежа = Заказ;
	ДвижениеНеоплаченныеЗаказы.Ответственный = Курьер;
	ДвижениеНеоплаченныеЗаказы.КоличествоНеоплаченныхЗаказов = 1;
	ДвижениеНеоплаченныеЗаказы.НеоплаченнаяСуммаЗаказов = СуммаЗаказа;
	
	Движения.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НеоплаченныеЗаказыОстатки.ОснованиеПлатежа КАК ОснованиеПлатежа
		|ИЗ
		|	РегистрНакопления.ДоставкиИОплаты.Остатки(, ОснованиеПлатежа = &ОснованиеПлатежа) КАК НеоплаченныеЗаказыОстатки
		|ГДЕ
		|	НеоплаченныеЗаказыОстатки.КоличествоНеоплаченныхЗаказовОстаток < 0";
	Запрос.УстановитьПараметр("ОснованиеПлатежа", Заказ);
	
	Если Не Запрос.Выполнить().Пустой() Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Заказ уже оплачен.";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Поле = "Заказ";
		Сообщение.Сообщить();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

//#Область ОписаниеПеременных
//
//#КонецОбласти

//#Область ПрограммныйИнтерфейс
//
//// Код процедур и функций
//
//#КонецОбласти

//#Область СлужебныйПрограммныйИнтерфейс
//
//// Код процедур и функций
//
//#КонецОбласти

//#Область СлужебныеПроцедурыИФункции
//
//// Код процедур и функций
//
//#КонецОбласти

//#Область Инициализация
//
//#КонецОбласти

#КонецЕсли
